<template>
  <div class="map">
    <div class="Thematicmap">
      <!-- 专题地图查询 -->
      <div class="maintools">
        <!-- 按钮 -->
        <div class="option">
          <ul>
            <li class="activation">制图条件设置</li>
          </ul>
          <span @click="dian()"
            ><icon-svg
              :icon-class="pan === 0 ? 'icon-toggle-left' : 'icon-toggle-right'"
              class="zhuang"
          /></span>
        </div>
        <!-- 内容 -->
        <div class="content son">
          <!-- 查询功能 -->
          <div class="find">
            <!-- 头部 -->
            <div class="top">
              <div class="imgIcon"></div>
              <span>{{ name }}</span>
            </div>
            <!-- 身体 -->
            <div style="width: 100%; height: 15%; top: 20px">
              <!-- 时间选择器 -->
              <div v-show="timedisplay" class="time">
                <el-row>
                  <el-col :span="12">
                    <el-date-picker
                      v-model="json.STime"
                      type="year"
                      placeholder="选择开始日期"
                      :picker-options="STime"
                    />
                  </el-col>
                  <el-col :span="12">
                    <el-date-picker
                      v-model="json.ETime"
                      type="year"
                      placeholder="选择结束日期"
                      :picker-options="ETime"
                    />
                  </el-col>
                </el-row>
              </div>
            </div>

            <div>
              <!--空间尺度-->
              <div v-show="spacedisplay" class="space">
                <el-row>
                  <el-col :span="8">
                    <p>空间尺度</p>
                  </el-col>
                  <el-col :span="16">
                    <el-select v-model="json.space" placeholder="请选择空间尺度"
                      ><el-option
                        v-for="item in space"
                        :key="item.value"
                        :label="item.label"
                        :value="item.value"
                    /></el-select>
                  </el-col>
                </el-row>
              </div>
            </div>
            <div>
              <!--空间尺度-->
              <div v-show="spacedisplay" class="space">
                <el-row>
                  <el-col :span="8">
                    <p>制图数据</p>
                  </el-col>
                  <el-col :span="16">
                    <el-select v-model="json.space" placeholder="请选择制图数据"
                      ><el-option
                        v-for="item in space"
                        :key="item.value"
                        :label="item.label"
                        :value="item.value"
                    /></el-select>
                  </el-col>
                </el-row>
              </div>
            </div>
            <div>
              <div v-show="Typedisplay" class="Type" style="margin: 1px 3px">
                <el-row>
                  <el-col :span="8">
                    <p>椭圆大小</p>
                  </el-col>
                  <el-col :span="16">
                    <el-select v-model="json.Type" placeholder="请选择数据类型"
                      ><el-option
                        v-for="item in Type"
                        :key="item.value"
                        :label="item.label"
                        :value="item.value"
                    /></el-select>
                  </el-col>
                </el-row>
              </div>
            </div>
            <!-- 尾部 -->
            <div class="bottom">
              <el-button-group>
                <el-button
                  style="
                    background-color: rgb(0, 206, 209);
                    color: #fff;
                    top: 12px;
                  "
                  icon="el-icon-search"
                  size="small"
                  @click="btnSelect"
                  >搜索</el-button
                >
                <!-- <el-button type="primary" icon="el-icon-s-order" size="small">统计</el-button> -->
                <el-button
                  style="
                    background-color: rgb(0, 206, 209);
                    color: #fff;
                    top: 12px;
                  "
                  icon="el-icon-refresh-left"
                  size="small"
                  @click="chongzhi"
                  >重置</el-button
                >
              </el-button-group>
              <div>
                <!-- <span style="height: 30px"></span> -->
                <p class="word" style="margin: 12px">{{ word }}</p>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- 盒子 -->
    <div v-if="ceng == 0">
      <lengRe :ceng="ceng" :pjson="subjson" />
    </div>
    <div v-if="ceng == 1">
      <gwr :ceng="ceng" :pjson="subjson" />
    </div>
    <div v-if="ceng == 2">
      <jvBu :ceng="ceng" :pjson="subjson" />
    </div>
    <div v-if="ceng == 3">
      <xinXing :ceng="ceng" :pjson="subjson" />
    </div>
    <div v-if="ceng == 4">
      <tuoYuan :ceng="ceng" :pjson="subjson" />
    </div>
    <!-- 按钮 -->
    <div class="special">
      <ul>
        <li @click="tian()">
          <p>冷热点分析</p>
          <!-- <icon-svg icon-class="icon-redian" class="img" /> -->
          <svg
            t="1647745426480"
            class="img"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="10992"
            width="128"
            height="128"
          >
            <path
              d="M463.450831 0h32.333779v361.707207a170.431349 170.431349 0 0 0-86.223411 27.823216l-16.166889 22.256418-16.166889 11.128209-16.16689 50.079635c-4.095612 11.855719-11.774884 52.159774-5.388963 72.341441h5.388963c5.200349 14.86276 3.233378 32.581671 10.777926 44.518225h5.388964c7.69005 10.088139 12.082055 13.256849 16.166889 27.823216a42.766812 42.766812 0 0 1 21.555853 11.128209v5.56141h10.777926v5.566799c19.901441 11.316823 40.050774 16.021387 70.056521 16.705786V1023.902999h-32.333779v-72.341442a55.689545 55.689545 0 0 0-21.555853-5.566799v5.566799h-16.166889c-6.887095 3.368102 1.616689 2.527424-5.388963 5.566799-5.09257 10.023471-7.463714 8.762454-10.777927 22.256418-20.558894-3.632161-38.143081-12.814954-43.111705-33.411571-8.552285-7.544548-9.360629-12.065888-10.777926-27.823217h10.777926c9.840247-16.991401 22.207917-16.662674 37.722742-27.823217l10.777927-16.705786h10.777926l5.388963-11.133598 16.16689-5.56141v-5.566799a42.244082 42.244082 0 0 1 21.555852-11.128208v-122.383354l-59.278595-16.705785c-13.132903-6.127251-20.725952-17.51413-37.722742-22.261807-26.842425 46.582197-75.650265 45.666074-75.445484 122.426465 10.944984 12.57784 16.253113 85.366565 16.16689 111.292867-28.022608 1.616689-38.434085 4.963235-64.667558 0-2.484312-7.442158-2.883095 1.86997-5.388963-5.566799v-38.951426h-5.388963v-11.128209c-1.390352-2.376533-7.544548-5.071014-10.777927-11.128209-6.116473 4.693787-0.7814-0.705954-5.388963 5.56141a178.045954 178.045954 0 0 0-48.500668 50.085024c-6.116473-4.699176-0.7814 0.705954-5.388963-5.566799-14.329253-8.15889-38.601143-31.940385-43.111706-50.079635 14.895094-8.519951 43.844604-37.000621 48.500669-55.651822-6.60148-3.341157-8.126556-9.484575-10.777926-11.128209h-10.777927v-5.56141c-25.613742-10.319864-33.31457 16.867455-43.111705-16.705786-11.720995-13.003568-1.525077-36.472503 0-55.646433l150.890968 16.705786 75.445484-83.47504c-21.582797-14.922039-32.425391-61.762907-43.111705-89.03106H177.835784c-3.63755 14.426254-8.476839 18.160806-16.166889 27.823217h-5.388964v11.128209l-16.166889 11.128209v11.128209l-10.777926 5.566798-5.388964 16.705786h-5.388963c-7.765496 9.737856-12.270669 13.429296-16.166889 27.823217-34.430086-2.694482-53.350735-23.635992-59.278595-55.646433l21.555853-5.566799c3.680662-18.387142 9.446852-21.36185 10.777926-44.518225-17.966803-6.946374-49.443737-5.825469-75.445484-5.56141V478.539928h70.056521a72.627056 72.627056 0 0 0 5.388963-27.823217c-7.334379-6.466756-8.234336-10.152807-10.777926-22.256418l-21.555853-5.566799c3.518993-21.227126 12.394615-39.387932 32.333779-44.518224 7.296656-8.832511 11.688661-9.662411 26.944816-11.128209v11.128209c18.155417 11.769496 20.364892 27.009483 32.333779 44.518224l16.166889 11.128209v11.128209l16.16689 11.128209v11.128209h5.388963l5.388963 11.133598h26.944816c12.933512 12.200613 63.120925 6.121862 86.22341 5.566799 3.712996-23.107874 11.737162-53.684851 21.555853-72.341442h5.388963v-11.106653h5.388963l5.388963-16.705785c-16.382448-9.624688-24.940121-25.753855-37.722742-38.951426-14.410087-14.878927-32.560115-25.62452-43.111705-44.518225l-5.388963 5.566799h-37.722742a355.396731 355.396731 0 0 1-97.001337 16.705786l-5.388963-55.651822h5.388963l5.388963-22.256418c26.55681 11.586271 52.747171 5.475187 59.278595-22.261807-14.895094-8.514562-43.844604-36.995232-48.500669-55.646434a133.813344 133.813344 0 0 0 43.111706-44.518224h5.388963v5.566799a178.110621 178.110621 0 0 1 48.500668 50.085023h5.388963v-5.566799c12.550895-9.09657 4.020167-2.888484 10.777927-16.705785h5.388963v-38.940648h5.388963v-5.566799h10.777926c12.594007-12.103611 35.319264-1.573577 53.889632 0l-21.555853 150.244293 80.834447 77.90824c30.011136-13.585576 53.205233-34.61331 91.612374-38.951426v-127.987875l-16.166889-5.566799v-5.561409l-16.16689-5.566799-5.388963-11.128209h-10.777926l-5.388964-11.128209-21.555852-5.566799-5.388963-11.128209h-10.777927v-5.566799l-16.166889-5.56141c2.586702-35.567157 22.886927-55.064425 53.889631-61.213232v11.128208l16.16689 11.128209v5.566799l32.333779 5.566799c4.548285-6.315865-0.684398-0.808344 5.388963-5.566799V0z m102.3903 150.244293h-37.722742C527.579492 121.187003 521.883358 13.418518 533.507352 0c1.66519 56.584113 28.674673 93.767959 32.333779 150.244293z m102.3903 33.411571c5.388963-21.448073 19.615826-25.807745 32.333779-38.951425 23.02704-23.80305 47.077982-61.073119 75.445484-77.902852v22.256418c-15.547159 16.845899-27.203486 100.148491-37.722742 127.987875-10.831816-3.190266-4.661453 0.668231-10.777927-5.566799-22.935427-5.690745-34.624088-22.024692-59.278594-27.844773z m-140.113042 22.256418c118.961362-0.689787 212.977213 75.41315 258.670231 150.249682l16.166889 50.079634h5.388964v16.705786c23.75455 66.251913 18.473366 133.446895-5.388964 194.767906v16.705786h-5.388963v11.133598h-5.388963v11.128209l-10.777926 5.56141v11.133598l-10.777926 5.561409v11.128209l-16.16689 11.133598v11.128209l-32.333779 27.823217-5.388963 11.128209h-10.777926l-10.777927 16.705786-21.555852 5.566799c-38.660422 24.589839-82.553527 44.458946-145.502005 44.512835V205.896115z m317.948826 161.377891c-5.6153-29.240514-25.403572-45.709185-32.333779-72.341442h5.388963V289.387321l140.113042-33.411571v5.566799l-80.834447 77.902851c-11.597049 11.914998-13.229905 22.461198-32.333779 27.823217z m177.835784 139.116083v11.133598c-25.241903 0.62512-40.891452 10.212085-59.278595 16.705786h-21.555853l-64.667557 22.261807V467.433275h5.388963v5.566799l37.722742 5.566799v5.566799z m-177.835784 150.249682c20.769064 5.545243 24.994011 20.257112 37.722742 33.411571 23.053984 23.781494 59.143871 48.613837 75.445484 77.908241h-21.555853v-5.566799l-37.722742-5.56141V751.221463h-21.555852v-5.550632h-21.555853v-5.566799h-16.166889V734.515677h-21.555853v-5.56141c-6.138029-6.34281-2.155585 0-5.388963-11.128208 13.262238-11.246766 28.124999-40.670505 32.333779-61.191677z m-177.835784 183.634308c15.342378-3.578272 64.338831-35.453989 70.056521-33.411571v5.566799c11.058152 12.534728 4.683009 26.761591 10.777926 44.518224h5.388963l21.555853 100.164658h-5.388963l-75.445485-83.46965c-11.559326-11.963498-21.749855-13.666411-26.944815-33.390016z m-140.113042 33.411572h37.722742c-0.582008 39.695103-16.592618 74.658695-26.944816 105.726068-5.836247 17.519519 0.388005 32.678673-10.777926 44.518224V873.658706z"
              p-id="10993"
              fill="#00CED1"
            ></path>
          </svg>
        </li>
        <li @click="re()">
          <p>GWR</p>
          <!-- <icon-svg icon-class="icon-jiaquanku" class="img" /> -->
          <svg
            t="1647745523177"
            class="img"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="12599"
            width="128"
            height="128"
          >
            <path
              d="M417.4 492c-30.4 0-60.6-13.1-81.4-38.3-17.9-21.7-26.3-49.1-23.6-77.1 2.7-28 16.1-53.3 37.9-71.2 21.7-17.9 49.3-26.3 77.1-23.6 28 2.7 53.3 16.1 71.2 37.9 37 44.8 30.6 111.4-14.3 148.3-19.5 16.1-43.3 24-66.9 24z m-0.2-150c-10.3 0-20.3 3.5-28.3 10.2-9.2 7.6-14.9 18.3-16 30.2-1.1 11.9 2.4 23.5 10 32.7 15.7 19 43.9 21.7 62.8 6.1 19-15.7 21.7-43.9 6-62.8-7.6-9.2-18.3-14.9-30.2-16-1.4-0.3-2.8-0.4-4.3-0.4zM460.4 781.6c-3.4 0-6.8-0.2-10.3-0.5-28-2.7-53.3-16.1-71.2-37.9-17.9-21.7-26.3-49.1-23.6-77.1 2.7-28 16.1-53.3 37.9-71.2 21.7-17.9 49.3-26.4 77.1-23.6 28 2.7 53.3 16.1 71.2 37.9 37 44.8 30.6 111.4-14.3 148.3-19.1 15.7-42.5 24.1-66.8 24.1z m-0.3-150.1c-10.3 0-20.3 3.5-28.3 10.2-9.2 7.6-14.9 18.3-16 30.2-1.1 11.9 2.4 23.5 10 32.7 7.6 9.2 18.3 14.9 30.2 16 11.8 1.2 23.5-2.4 32.7-10 19-15.7 21.7-43.9 6-62.8-7.6-9.2-18.3-14.9-30.2-16-1.5-0.2-3-0.3-4.4-0.3zM657.2 558.1c-3.4 0-6.8-0.2-10.3-0.5-28-2.7-53.3-16.1-71.2-37.9-17.9-21.7-26.3-49.1-23.6-77.1 2.7-28 16.1-53.3 37.9-71.2 44.8-36.9 111.4-30.6 148.3 14.3 36.9 44.8 30.5 111.4-14.3 148.3-19 15.8-42.4 24.1-66.8 24.1z m-0.2-150c-10 0-20.1 3.3-28.4 10.2-9.2 7.6-14.9 18.3-16 30.2-1.1 11.9 2.4 23.5 10 32.7 7.6 9.2 18.3 14.9 30.2 16 11.8 1.2 23.5-2.4 32.7-10 19-15.7 21.7-43.9 6.1-62.8-9-10.7-21.8-16.3-34.6-16.3z"
              p-id="12600"
              fill="#00CED1"
            ></path>
            <path
              d="M445.8 621.1c-14.3 0-27-10.1-29.8-24.7l-21.5-112.7c-3.1-16.5 7.7-32.4 24.1-35.5 16.6-3.1 32.4 7.7 35.5 24.1L475.6 585c3.1 16.5-7.7 32.4-24.1 35.5-1.9 0.4-3.8 0.6-5.7 0.6zM590.8 448c-2.3 0-4.7-0.3-7.1-0.8l-98.8-23.5c-16.3-3.9-26.4-20.2-22.5-36.6 3.9-16.3 20.1-26.4 36.6-22.5l98.8 23.5c16.3 3.9 26.4 20.2 22.5 36.6-3.3 13.9-15.8 23.3-29.5 23.3z"
              p-id="12601"
              fill="#00CED1"
            ></path>
            <path
              d="M716.9 891.8H309.1c-10.9 0-20.9-5.8-26.3-15.2L78.9 523.5c-5.4-9.4-5.4-21 0-30.4l203.9-353.2c5.4-9.4 15.4-15.2 26.3-15.2h407.8c10.9 0 20.9 5.8 26.3 15.2l203.9 353.2c5.4 9.4 5.4 21 0 30.4L743.2 876.6c-5.4 9.4-15.5 15.2-26.3 15.2z m-390.3-60.7h372.7l186.4-322.8-186.3-322.8H326.6L140.3 508.3l186.3 322.8z"
              p-id="12602"
              fill="#00CED1"
            ></path>
          </svg>
        </li>
        <li @click="ying()">
          <p>局部莫兰</p>
          <!-- <icon-svg icon-class="icon-jianceyichangzhimidu" class="img" /> -->
          <svg
            t="1647745562904"
            class="img"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="13493"
            width="128"
            height="128"
          >
            <path
              d="M843.676672 360.486912c-9.746432-4.180992-21.11488-8.476672-32.129024-12.416 2.31424-11.836416 4.406272-23.095296 5.341184-34.265088 11.346944-92.941312-7.656448-165.812224-59.1872-196.67456l-1.869824-1.045504c-52.201472-30.394368-125.31712-10.569728-201.101312 46.058496-9.166848 6.764544-17.977344 14.508032-27.255808 21.9392-9.279488-7.431168-17.980416-15.174656-27.25888-21.9392-74.628096-56.027136-147.2768-75.874304-199.832576-46.748672l-1.512448 0.690176c-52.578304 30.394368-72.070144 103.733248-60.811264 197.71904 1.626112 11.169792 3.115008 22.428672 5.4528 34.265088-11.015168 3.939328-21.940224 8.235008-32.487424 12.416-87.020544 37.024768-140.869632 90.604544-140.869632 151.414784 0 60.923904 53.848064 114.302976 140.869632 151.906304 10.546176 4.048896 21.471232 8.23296 32.487424 12.306432-2.337792 11.370496-3.826688 22.962176-5.4528 33.997824-11.25888 94.009344 8.23296 167.079936 61.034496 197.496832 52.800512 30.640128 125.915136 11.148288 201.122816-46.058496 9.279488-6.740992 17.980416-13.927424 27.25888-21.605376 9.279488 7.677952 18.08896 14.864384 27.255808 21.605376 75.784192 57.206784 148.89984 76.698624 201.101312 46.30528l0-0.24576c52.80256-30.416896 72.403968-103.488512 61.057024-197.496832-0.934912-11.035648-3.026944-22.628352-5.341184-33.997824 11.014144-4.073472 22.382592-8.256512 32.129024-12.306432 87.048192-37.603328 140.89216-90.9824 140.89216-151.906304C984.568832 451.091456 930.724864 397.510656 843.676672 360.486912L843.676672 360.486912zM580.498432 196.9664 580.498432 196.9664c61.27616-46.08 118.017024-64.171008 153.971712-43.276288l0.603136 0.222208c35.489792 21.138432 47.92832 78.789632 38.293504 154.79808-0.6912 8.476672-2.313216 17.288192-3.381248 26.011648-38.872064-10.324992-81.329152-18.802688-126.340096-24.1664-27.057152-36.068352-55.581696-69.020672-83.661824-96.877568C566.56896 207.981568 573.889536 202.084352 580.498432 196.9664L580.498432 196.9664zM347.021312 614.834176 347.021312 614.834176l0.466944 1.045504c10.102784 17.068032 19.848192 32.975872 29.950976 48.953344-29.372416-4.983808-57.00608-11.124736-83.217408-17.980416 6.720512-26.32192 15.218688-53.578752 26.211328-81.435648C328.465408 581.880832 337.519616 598.36928 347.021312 614.834176L347.021312 614.834176zM294.2208 377.4208 294.2208 377.4208c26.211328-7.433216 53.844992-13.351936 83.439616-18.225152-10.324992 15.664128-20.0704 32.132096-30.173184 48.864256-9.521152 16.821248-18.80064 33.753088-27.056128 50.240512C309.439488 430.799872 300.941312 403.163136 294.2208 377.4208L294.2208 377.4208zM342.61504 512.124928 342.61504 512.124928c12.439552-27.035648 26.811392-54.892544 42.47552-82.149376 15.6672-27.61216 32.709632-53.470208 49.998848-77.966336 29.617152-2.916352 60.455936-4.4288 92.386304-4.4288 31.906816 0 62.903296 1.512448 92.494848 4.4288 17.155072 24.496128 34.22208 50.354176 49.887232 77.966336l0.79872 1.045504c15.442944 27.0336 29.372416 54.068224 41.653248 80.879616-12.52352 27.25888-26.65472 54.784-42.697728 82.172928l-0.46592 0.666624c-15.44192 27.300864-32.24064 53.046272-49.174528 77.298688-29.591552 2.557952-60.588032 4.629504-92.494848 4.629504-31.930368 0-62.769152-2.070528-92.386304-4.629504-17.288192-24.475648-34.330624-50.463744-49.998848-77.966336l-0.487424-1.068032C368.847872 565.861376 355.054592 538.602496 342.61504 512.124928L342.61504 512.124928zM706.392064 617.16992 706.392064 617.16992l1.42336-1.291264c9.280512-16.733184 18.424832-33.997824 26.65472-50.46272 10.927104 27.856896 19.627008 55.113728 26.012672 81.435648-25.409536 6.854656-53.736448 12.995584-83.10784 17.980416C687.388672 649.411584 696.891392 633.413632 706.392064 617.16992L706.392064 617.16992zM708.25984 408.859648 708.25984 408.859648l-0.44544-0.799744c-9.877504-16.73216-20.204544-33.199104-30.440448-48.864256 29.372416 4.873216 57.698304 10.791936 83.10784 18.225152-6.385664 25.74336-15.085568 53.379072-26.012672 80.879616C726.240256 442.41408 717.31712 425.570304 708.25984 408.859648L708.25984 408.859648zM527.474688 242.58048 527.474688 242.58048c19.600384 18.557952 38.647808 40.163328 57.20576 63.347712-18.557952-1.624064-37.6064-1.624064-57.20576-1.624064-19.49184 0-38.540288 0-57.428992 1.624064C489.179136 282.743808 508.205056 261.138432 527.474688 242.58048L527.474688 242.58048zM320.431104 153.689088 320.431104 153.689088l1.068032-0.466944c36.535296-19.825664 92.251136-1.84832 152.94976 43.743232 6.720512 5.117952 13.930496 11.016192 20.873216 16.71168-28.54912 27.856896-56.962048 60.81024-84.243456 96.877568-45.011968 5.362688-87.266304 13.841408-125.893632 24.1664-1.73568-8.723456-2.803712-17.536-3.849216-26.011648C272.059392 232.700928 284.474368 174.560256 320.431104 153.689088L320.431104 153.689088zM253.010944 633.413632 253.010944 633.413632c-8.675328-3.383296-17.043456-6.163456-24.695808-9.745408-70.580224-30.396416-114.658304-69.645312-114.658304-111.767552 0-41.76384 44.07808-81.458176 114.658304-111.496192 7.653376-3.381248 16.464896-6.519808 24.695808-10.102784 10.34752 39.205888 24.254464 79.835136 42.276864 121.598976C277.265408 554.023936 263.358464 594.295808 253.010944 633.413632L253.010944 633.413632zM474.44992 826.728448 474.44992 826.728448c-61.27616 46.190592-117.438464 64.171008-154.017792 43.522048-35.95776-20.537344-48.372736-78.456832-39.094272-154.932224 1.045504-8.209408 2.113536-17.289216 3.849216-26.322944 38.627328 10.790912 80.881664 19.136512 125.893632 24.254464 27.281408 36.535296 55.693312 69.511168 84.243456 97.011712C488.379392 816.1792 481.170432 821.874688 474.44992 826.728448L474.44992 826.728448zM527.474688 781.248512 527.474688 781.248512c-19.269632-18.581504-38.295552-39.918592-57.428992-63.371264 18.888704 1.512448 37.936128 2.091008 57.428992 2.091008 19.600384 0 38.647808-0.57856 57.20576-2.091008C566.122496 741.328896 547.075072 762.665984 527.474688 781.248512L527.474688 781.248512zM734.470144 870.250496 734.470144 870.250496c-35.954688 20.64896-92.695552 2.668544-153.971712-43.165696-6.607872-5.209088-13.929472-10.904576-20.514816-16.823296 28.080128-27.500544 56.604672-60.47744 83.661824-97.011712 45.010944-5.116928 87.468032-13.462528 126.340096-24.254464 1.068032 9.033728 2.690048 18.113536 3.381248 26.322944C783.000576 791.79264 770.563072 849.713152 734.470144 870.250496L734.470144 870.250496zM826.744832 623.669248 826.744832 623.669248c-7.76704 3.581952-16.265216 6.362112-24.721408 9.745408-10.10176-39.117824-24.25344-79.389696-42.22976-121.288704 17.977344-41.987072 32.128-82.61632 42.22976-121.822208 8.456192 3.582976 16.954368 6.720512 24.721408 10.102784 70.556672 30.036992 114.302976 69.732352 114.302976 111.496192C941.047808 554.023936 897.301504 593.272832 826.744832 623.669248L826.744832 623.669248z"
              p-id="13494"
              fill="#00CED1"
            ></path>
          </svg>
        </li>
        <li @click="jv()">
          <p>新兴时空热点</p>
          <!-- <icon-svg icon-class="icon-zhanlvexinxingchanye" class="img" /> -->
          <svg
            t="1647745607626"
            class="img"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="14401"
            width="128"
            height="128"
          >
            <path
              d="M904 1024H120c-66.168 0-120-53.832-120-120V120C0 53.832 53.832 0 120 0h784c66.168 0 120 53.832 120 120v784c0 66.168-53.832 120-120 120zM120 4C56.038 4 4 56.038 4 120v784c0 63.962 52.038 116 116 116h784c63.962 0 116-52.038 116-116V120c0-63.962-52.038-116-116-116H120z"
              fill="#00CED1"
              p-id="14402"
            ></path>
            <path
              d="M252 420H192v-98c0-71.682 58.318-130 130-130h98v60h-98c-38.598 0-70 31.402-70 70v98zM420 832h-98c-71.682 0-130-58.318-130-130v-98h60v98c0 38.598 31.402 70 70 70h98v60zM832 420h-60v-98c0-38.598-31.402-70-70-70h-98V192h98c71.682 0 130 58.318 130 130v98zM702 832h-98v-60h98c38.598 0 70-31.402 70-70v-98h60v98c0 71.682-58.318 130-130 130z"
              fill="#00CED1"
              p-id="14403"
            ></path>
            <path
              d="M559.162 450.858m-66 0a66 66 0 1 0 132 0 66 66 0 1 0-132 0Z"
              fill="#00CED1"
              p-id="14404"
            ></path>
            <path
              d="M560.302 516.848l-1.142 0.01c-17.628 0-34.202-6.864-46.668-19.33C500.026 485.062 493.162 468.488 493.162 450.858 493.162 415.08 522.256 385.476 558.018 384.868L559.162 384.858c17.628 0 34.202 6.864 46.668 19.33S625.162 433.228 625.162 450.858c0 35.78-29.094 65.382-64.86 65.99z m-2.25-129.98C523.374 387.458 495.162 416.164 495.162 450.858c0 17.096 6.656 33.168 18.744 45.256C525.994 508.202 542.066 514.858 559.162 514.858l1.108-0.01C594.948 514.26 623.162 485.554 623.162 450.858c0-17.096-6.656-33.168-18.744-45.256C592.328 393.516 576.256 386.858 559.16 386.858l-1.108 0.01z"
              fill="#00CED1"
              p-id="14405"
            ></path>
            <path
              d="M424.458 519.55m-26 0a26 26 0 1 0 52 0 26 26 0 1 0-52 0Z"
              fill="#00CED1"
              p-id="14406"
            ></path>
            <path
              d="M424.908 545.546L424.458 545.55C410.122 545.55 398.458 533.886 398.458 519.548 398.458 505.456 409.92 493.794 424.008 493.554L424.458 493.55a25.82 25.82 0 0 1 18.384 7.616A25.828 25.828 0 0 1 450.458 519.552c0 14.094-11.462 25.754-25.55 25.994z m-0.866-49.992C411.038 495.774 400.458 506.54 400.458 519.55c0 13.234 10.766 24 24 24l0.416-0.004C437.878 543.326 448.458 532.562 448.458 519.55c0-6.41-2.496-12.438-7.028-16.97S430.87 495.55 424.458 495.55l-0.416 0.004z"
              fill="#00CED1"
              p-id="14407"
            ></path>
            <path
              d="M556.294 600.55m-37 0a37 37 0 1 0 74 0 37 37 0 1 0-74 0Z"
              fill="#00CED1"
              p-id="14408"
            ></path>
            <path
              d="M556.934 637.546L556.292 637.55c-9.882 0-19.174-3.85-26.162-10.838S519.294 610.432 519.294 600.548C519.292 580.492 535.6 563.896 555.648 563.556L556.294 563.55c20.4 0 36.998 16.598 37 37-0.004 20.06-16.314 36.654-36.36 36.996z m-1.252-71.99C536.718 565.878 521.29 581.576 521.294 600.55a34.768 34.768 0 0 0 10.248 24.75A34.764 34.764 0 0 0 556.292 635.55l0.608-0.004C575.864 635.224 591.292 619.524 591.294 600.55 591.292 581.25 575.59 565.55 556.292 565.55l-0.61 0.006z"
              fill="#00CED1"
              p-id="14409"
            ></path>
          </svg>
        </li>
        <li @click="feng()">
          <p>标准差椭圆</p>
          <!-- <icon-svg icon-class="icon-tuoyuan" class="img" /> -->
          <svg
            t="1647745684614"
            class="img"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="16521"
            width="128"
            height="128"
          >
            <path
              d="M512 93.866667a93.9008 93.9008 0 0 1 92.194133 76.117333c157.508267 27.255467 284.433067 123.136 327.389867 248.6784a93.866667 93.866667 0 0 1 0 186.6752C888.644267 730.862933 761.719467 826.760533 604.16 854.016a93.866667 93.866667 0 0 1-184.3712 0c-157.405867-27.2384-284.416-123.050667-327.389867-248.6784a93.866667 93.866667 0 0 1 0-186.6752C135.338667 293.1712 262.229333 197.239467 419.7888 169.984A93.883733 93.883733 0 0 1 512 93.866667z m0 699.733333a42.666667 42.666667 0 1 0 0 85.333333 42.666667 42.666667 0 0 0 0-85.333333z m87.722667-572.416l-0.887467 2.269867a93.9008 93.9008 0 0 1-174.557867-2.235734C289.518933 245.76 182.289067 325.6832 143.598933 427.639467a93.866667 93.866667 0 1 1 0 168.721066c38.741333 102.058667 146.039467 181.896533 280.6784 206.455467a93.883733 93.883733 0 0 1 175.445334 0c134.741333-24.576 241.988267-104.482133 280.6784-206.455467a93.866667 93.866667 0 1 1 0-168.721066C841.728 325.649067 734.446933 245.76 599.722667 221.184zM102.4 469.333333a42.666667 42.666667 0 1 0 0 85.333334 42.666667 42.666667 0 0 0 0-85.333334z m819.2 0a42.666667 42.666667 0 1 0 0 85.333334 42.666667 42.666667 0 0 0 0-85.333334z m-409.6-324.266666a42.666667 42.666667 0 1 0 0 85.333333 42.666667 42.666667 0 0 0 0-85.333333z"
              fill="#00CED1"
              p-id="16522"
            ></path>
          </svg>
        </li>
      </ul>
    </div>
  </div>
</template>
<script>
import LengRe from "./components/lengRe"; // 数据插入
import Gwr from "./components/gwr";
import JvBu from "./components/jvBu";
import XinXing from "./components/xinXing";
import TuoYuan from "./components/tuoYuan";

export default {
  name: "Spacetime",
  components: {
    LengRe,
    Gwr,
    JvBu,
    XinXing,
    TuoYuan,
  },
  data() {
    return {
      ceng: 0,
      json: {
        STime: new Date("2018"),
        ETime: new Date("2019"),
        space: "",
        source:"",
        Type: "",
        c: 0,
      },
      STime: {
        disabledDate: (time) => {
          if (this.json.ETime !== "") {
            return (
              time.getTime() < new Date("2011-12-31") ||
              time.getTime() > this.json.ETime
            );
          } else {
            return time.getTime() < new Date("2011-12-31");
          }
        },
      },
      ETime: {
        disabledDate: (time) => {
          return (
            time.getTime() < this.json.STime ||
            time.getTime() < new Date("2011-12-31") ||
            time.getTime() > new Date("2018-12-31")
          );
        },
      },
      name: "冷热点分析",
      space: [
        {
          value: "市级",
          label: "省级",
        },
        {
          value: "县级",
          label: "市级",
        },
        {
          value: "街道",
          label: "县级",
        },
      ],
      source:[
         {
          value: "市级",
          label: "省级",
        },
        {
          value: "县级",
          label: "市级",
        },
        {
          value: "街道",
          label: "县级",
        },
      ],
      Type: [
        {
          value: "1_STANDARD_DEVIATION",
          label: "小号",
        },
        {
          value: "2_STANDARD_DEVIATIONS",
          label: "中号",
        },
        {
          value: "3_STANDARD_DEVIATIONS",
          label: "大号",
        },
      ],
      checked: true,
      pan: 1,
      // 移动
      canMove: false,
      timedisplay: true,
      spacedisplay: true,
      Typedisplay: false,
      subjson: "",
      word: "冷热点分析是GIS中的一种空间分析方法，是对数据集中的每一个要素计算 Getis-Ord Gi* 统计（称为 G-i-星号）。得到 z 得分和 p 值，对应统计学中的聚类，将数据分为高值和低值，其目的在于突出空间特征，颜色越深表示区域高/低值聚集程度越强。",
    };
  },
  created() {
    setTimeout(function () {
      document.getElementsByClassName("map")[0].style.display = "block";
    }, 200);
  },
  destroyed() {
    document.getElementsByClassName("map")[0].style.display = "none";
  },
  mounted() {
    var that = this;
    var li = document.querySelectorAll(".option li");
    var content = document.querySelectorAll(".content");
    for (var i = 0; i < li.length; i++) {
      // 设置索引
      li[i].setAttribute("index", i);
      li[i].addEventListener("click", function () {
        for (var j = 0; j < li.length; j++) {
          li[j].classList.remove("activation");
        }
        this.className = this.className + " " + "activation";
        // 拿到索引
        var index = this.getAttribute("index");
        for (var k = 0; k < content.length; k++) {
          content[k].classList.remove("son");
        }
        content[index].className = content[index].className + " " + "son";
        document.getElementsByClassName("maintools")[0].style.right = "0";
        that.pan = 1;
      });
    }
  },
  methods: {
    btnSelect() {
      var that = this;
      const STime = new Date(that.json.STime);
      const ETime = new Date(that.json.ETime);
      that.json.STime =
        STime.getFullYear() +
        "-" +
        this.checkTime(STime.getMonth() + 1) +
        "-" +
        this.checkTime(STime.getDate());
      that.json.ETime =
        ETime.getFullYear() +
        "-" +
        this.checkTime(ETime.getMonth() + 1) +
        "-" +
        this.checkTime(ETime.getDate());
      that.json.c++;
      this.subjson = this.json;
    },
    checkTime(i) {
      if (i < 10) {
        i = "0" + i;
      }
      return i;
    },
    chongzhi() {
      this.json = {
        STime: new Date("2018-01-01"),
        ETime: new Date("2018-01-01"),
        space: "",
        Type: "",
        c: 0,
      };
    },
    dian() {
      if (this.pan === 0) {
        document.getElementsByClassName("maintools")[0].style.right = "0";
        this.pan = 1;
      } else {
        document.getElementsByClassName("maintools")[0].style.right = "-300px";
        this.pan = 0;
      }
    },
    tian() {
      this.ceng = 0;
      if (this.ceng === 0) {
        this.timedisplay = true;
        this.spacedisplay = true;
        this.Typedisplay = false;
        this.name = "冷热点分析分析";
      }
      this.word =
        "冷热点分析是GIS中的一种空间分析方法，是对数据集中的每一个要素计算 Getis-Ord Gi* 统计（称为 G-i-星号）。得到 z 得分和 p 值，对应统计学中的聚类，将数据分为高值和低值，其目的在于突出空间特征，颜色越深表示区域高/低值聚集程度越强。";
    },
    re() {
      this.ceng = 1;
      if (this.ceng === 1) {
        this.timedisplay = true;
        this.spacedisplay = true;
        this.Typedisplay = false;
        this.name = "地理加权回归分析";
      }
      this.word =
        "通过构建城市地理加权回归模型，分析我国拐卖儿童案件发生与区域教育水平、地区生产总值、人均GDP、人均可支配收入、公路里程数等的关联。";
    },
    ying() {
      this.ceng = 2;
      if (this.ceng === 2) {
        this.timedisplay = true;
        this.spacedisplay = true;
        this.Typedisplay = false;
        this.name = "局部莫兰指数分析";
      }
      this.word =
        "通过分析测算空间关联局域指标（Local Indicators of Spatial Association, LISA）显著水平，通过局部自相关分析方法，分析中国拐卖儿童整体空间关联趋势，得出不同尺度范围下我国各区域拐卖之间的关联和影响。";
    },
    jv() {
      this.ceng = 3;
      if (this.ceng === 3) {
        this.timedisplay = true;
        this.spacedisplay = false;
        this.Typedisplay = false;
        this.name = "新兴时空热点分析";
      }
      this.word =
        "新兴时空热点分析是GIS中的一种空间分析方法，能够根据某一段时间内已存在的地理分布数据做后续发展的时间和空间分析，通过新兴时空热点分析，获取被拐儿童热点和冷点趋势，分析我国拐卖儿童犯罪的时空演化特征，包括拐卖儿童案发数随时间变化的整体趋势、整体的范围、空间等级变化的整体趋势以及犯罪重心随时间变化的整体趋势。";
    },
    feng() {
      this.ceng = 4;
      if (this.ceng === 4) {
        this.timedisplay = true;
        this.spacedisplay = false;
        this.Typedisplay = true;
        this.name = "标准差椭圆分析";
      }
      this.word =
        "分别计算 x 和 y 方向上的标准距离，用于定义一个包含所有要素分布的椭圆的轴，用于展示空间要素在空间分布中的趋势，用以反映中国拐卖儿童的空间分布和移动特征。";
    },
    san() {
      this.ceng = 5;
      if (this.ceng === 5) {
        this.timedisplay = true;
        this.spacedisplay = true;
        this.Typedisplay = false;
      }
    },
    mi() {
      this.ceng = 6;
      if (this.ceng === 6) {
        this.timedisplay = true;
        this.spacedisplay = true;
        this.Typedisplay = false;
      }
    },
    shi() {
      this.ceng = 7;
      if (this.ceng === 7) {
        this.timedisplay = false;
        this.spacedisplay = false;
        this.Typedisplay = false;
      }
    },
  },
};
</script>
<style scoped>
.map {
  /* overflow-x:hidden;overflow-y:hidden; */
  display: none;
  animation: fade-in;
  animation-duration: 1s;
  -webkit-animation: fade-in 1s;
}
.special {
  position: absolute;
  /* 为了不遮住 表格 */
  z-index: 99;
  bottom: 7%;
  left: 50%;
  /* transform: translate(-50%, 0); */
  background-color: rgba(40, 43, 57, 0.8);
  border: 1px solid rgb(74, 78, 85);
  border-radius: 15px;
  width: 660px;
  height: 40px;
  line-height: 40px;
  animation: fade-in;
  animation-duration: 1.2s;
  -webkit-animation: fade-in 1.2s;
  text-align: center;
  transform: translate(-50%, 0) skew(-20deg);
}
.special ul {
  margin: 0;
  padding: 0;
  height: 45px;
  list-style-type: none;
  position: absolute;
  /* left: 50%; */
  width: 100%;
  /* transform: translate(-50%, 0); */
  transform: skew(20deg);
  top: -20px;
}
.special li {
  display: inline-block;
  margin: 0 20px;
  margin-top: 3px;
  cursor: pointer;
  position: relative;
}
.special li .img {
  width: 30px;
  height: 30px;
  -webkit-box-reflect: below 7px -webkit-gradient(linear, left top, left bottom, from(transparent), color-stop(0.3, transparent), to(rgba(255, 255, 255, 0.5)));
  transition: all 0.3s;
  transform-origin: 40% 70%;
}
.special li p {
  margin: 0;
  padding: 0;
  display: none;
  position: absolute;
  bottom: 90px;
  left: 0;
  width: 100%;
  background-color: #222;
  border-radius: 5px;
  height: 40px;
  line-height: 40px;
}
.special li:hover p {
  display: block;
  color: #fff;
  animation: fade-in;
  animation-duration: 0.5s;
  -webkit-animation: fade-in 0.5s;
}
.special li:hover .img {
  transform: scale(2);
  margin: 0 30px;
}
.special li:hover + li .img,
.special li.prev .img {
  transform: scale(1.5);
  margin: 0 10px;
}

@keyframes fade-in {
  0% {
    opacity: 0;
  }
  /*初始状态 透明度为0*/
  40% {
    opacity: 0;
  }
  /*过渡状态 透明度为0*/
  100% {
    opacity: 1;
  }
  /*结束状态 透明度为1*/
}
</style>
<style lang="less" scoped>
@font-face {
  src: url("./public/font/KuHei.ttf");
  font-family: "KuHei";
}
@keyframes fade-in {
  0% {
    opacity: 0;
  }

  /*初始状态 透明度为0*/
  40% {
    opacity: 0;
  }

  /*过渡状态 透明度为0*/
  100% {
    opacity: 1;
  }

  /*结束状态 透明度为1*/
}
.Thematicmap .find p {
  display: block;
  color: #fff;
  margin: 10px;
  padding: 0;
  /* background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%; */
}
.Thematicmap .find {
  position: absolute;
  text-align: center;
  width: 300px;
  /* border-radius: 5px; */
  height: 430px;
  /* border: 1px solid rgb(39,45,57);
  background-color: rgba(40, 43, 57, 0.8); */
  z-index: 100;
  user-select: none;

  /* top: 10px;
  right: 10px;
  left: 10px; */
}
.Thematicmap .find .top {
  /* background-color: rgb(40, 43, 57); */
  color: rgba(255, 255, 255, 0.8);
  /* border-bottom: 1px solid #fff; */
  background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%;
  /* border-bottom-right-radius: 5px;
  border-bottom-left-radius: 5px; */
  width: 100%;
  height: 30px;
  line-height: 30px;
  cursor: move;
  user-select: none;
  display: flex;
  > span {
    width: 50%;
    height: 100%;
    text-align: left;
    font-weight: bold;
  }
  .imgIcon {
    width: 12%;
    height: 100%;
    margin-left: 6%;
    background: url("../../assets/img/panelIcon.png");
    background-size: 100% 100%;
  }
}
/* 时间范围 */
.Thematicmap .find .time {
  width: 100%;
  height: 100%;
  background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%;
}
.Thematicmap .find .time .el-date-editor.el-input {
  width: 140px !important;
  margin: 10px 0px;
  /* background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%; */
}
/* 空间尺度 */
.space {
  margin: 1px 3px;
  /* border-top: 1px solid #fff; */
  padding: 10px;
  background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%;
}
.Type {
  margin: 0px 3px;
  top: 0px;
  /* border-top: 1px solid #fff; */
  background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%;
  padding: 10px;
}
/* 底部 */
/* .Thematicmap .find{
  border-top: 1px solid #fff;
  background: url("./public/ptbg.png") no-repeat center center;
} */
.Thematicmap .find .bottom {
  margin-top: 1px;
  /* border-top: 1px solid #fff; */
  background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%;
  /* border-top-right-radius: 5px;
  border-top-left-radius: 5px;
  border-bottom-right-radius: 5px;
  border-bottom-left-radius: 5px; */
  /* background-color: rgb(40, 43, 57); */
  color: rgba(255, 255, 255, 0.8);
  width: 100%;
  height: 100%;
  line-height: 35px;
  user-select: none;
  display: flex;
  flex-direction: column;
  justify-content: flex-start;
  align-items: center;
}
.el-button-group {
  height: 13%;
  width: 100%;
  display: flex;
  justify-content: space-around;
  flex-direction: row;
  align-items: center;
}
.el-button-group > .el-button {
  width: 30%;
}
.Thematicmap .find .bottom .word {
  /* width: 80%; */
  height: 100%;
  color: #fff;
  top: 10%;
  text-align: center;
}
.el-button {
  background: #73e3e8 !important;
}
/* 主要工具 */
.Thematicmap .maintools {
  position: relative;
  text-align: center;
  width: 300px;
  height: 100%;
  right: 0px;
  top: 0;
  border-bottom-left-radius: 5px;
  /* background-color: rgba(40, 43, 57, 0.8);*/
  /* border-left: 1px solid rgb(102, 103, 105);  */
  /* background: url("./public/ptbg.png") no-repeat center center;
  background-size: 100% 100%; */
  /* 不阻挡表格 */
  z-index: 99;
  transition: all 1.5s;
}
/* 选项 */
.Thematicmap .maintools .option {
  position: absolute;
  left: -31px;
  top: 0;
}
.Thematicmap .maintools .option .zhuang {
  border: 1px solid rgb(173, 175, 179);
  background-color: rgba(40, 43, 57, 0.8);
  border-right: none;
  border-top-left-radius: 5px;
  border-bottom-left-radius: 5px;
  color: #fff;
  cursor: pointer;
  width: 30px;
  height: 35px;
}
.Thematicmap .maintools .option ul {
  list-style-type: none;
  padding: 0;
  margin: 0;
}
.Thematicmap .maintools .option ul li {
  padding: 10px 0;
  width: 30px;
  margin: 0 auto;
  margin-bottom: 5px;
  border: 1px solid rgb(173, 175, 179);
  background-color: rgba(40, 43, 57, 0.8);
  border-right: none;
  border-top-left-radius: 5px;
  border-bottom-left-radius: 5px;
  color: #fff;
  font-family: KuHei;
  cursor: pointer;
}
.Thematicmap .maintools .option .activation {
  position: relative;
}
.Thematicmap .maintools .option .activation::after {
  content: "";
  position: absolute;
  width: 2px;
  height: 100%;
  right: -1px;
  top: 0;
  background: rgb(0, 206, 209);
}
/* 内容 */
.Thematicmap .maintools .content {
  display: none;
}
.Thematicmap .maintools .son {
  display: block;
  animation: fade-in;
  animation-duration: 1s;
  -webkit-animation: fade-in 1s;
}
</style>
